IDEA Open Model
CrossSectionComponent.Components Property
Compatible with IDEA StatiCa v 10.1
 List of components
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<CssComponent> Components { get; set; }
Public Property Components As List(Of CssComponent)
	Get
	Set
public:
property List<CssComponent^>^ Components {
	List<CssComponent^>^ get ();
	void set (List<CssComponent^>^ value);
}
Property Value
Type: List<CssComponent>
See Also
Reference
CrossSectionComponent Class
IdeaRS.OpenModel.CrossSection Namespace